# Даны три стороны треугольника a,b,c.
# Определите тип треугольника с заданными сторонами. Выведите одно из четырех слов:
# rectangular для прямоугольного треугольника,
# acute для остроугольного треугольника,
# obtuse для тупоугольного треугольника или impossible,
# если треугольника с такими сторонами не существует (считаем, что вырожденный треугольник тоже невозможен).
# Формат ввода
# Вводятся три целых числа.
# Формат вывода
# Выведите ответ на задачу.
a, b, c = int(input()), int(input()), int(input())
